app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Omar"], ["content", "I'm on Treebook"], ["created_at", "2016-07-01 16:27:04.715190"], ["updated_at", "2016-07-01 16:27:04.715190"]]
---
  def create
    @status = current_user.statuses.new(status_params)

    respond_to do |format|
      if @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."user_id" = ? AND "statuses"."id" = ? LIMIT 1  [["user_id", 14887631], ["id", 980190962]]
UPDATE "statuses" SET "name" = ?, "content" = ?, "updated_at" = ? WHERE "statuses"."id" = ?  [["name", "Ali"], ["content", "Hello there i'm using treebook!"], ["updated_at", "2016-07-03 12:24:02.588884"], ["id", 2]]
---
  def update
    @status = current_user.statuses.find(params[:id])
    params[:status].delete(:user_id) if params[:status].has_key?(:user_id)
    respond_to do |format|
      if @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 3]]
---
  def destroy
    @status.destroy

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_status
      @status = Status.find(params[:id])