app/controllers/user_friendships_controller.rb

	def new
		if params[:friend_id]
			@friend = User.where(profile_name: params[:friend_id]).first
---
SELECT  "users".* FROM "users" WHERE "users"."profile_name" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["profile_name", "jimmy88"]]

	def create
		if params[:user_friendship] && params[:user_friendship].has_key?(:friend_id)
			@friend = User.where(profile_name: params[:user_friendship][:friend_id]).first
			@user_friendship = current_user.user_friendships.new(friend: @friend)
			@user_friendship.save
---
SELECT  "users".* FROM "users" WHERE "users"."profile_name" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["profile_name", "#<User:0xb82d008>"]]
INSERT INTO "user_friendships" ("friend_id", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["friend_id", 3], ["state", "pending"], ["user_id", 1], ["created_at", "2016-08-14 10:41:30.573200"], ["updated_at", "2016-08-14 10:41:30.573200"]]